c-test1.md

# Table of Contents

1.  [简答题](#org28bf6d5)
    1.  [给出下列语句的循环次数(10分)](#org303a8d6)
2.  [论述题](#org27b8e06)
    1.  [简述你对于程序设计(编程)的理解(15分)](#org4c552bd)
    2.  [阅读理解(15分)](#org167c295)
    3.  [我们已经学习完了C语言的所有数据类型, 请你阐述对于C语言数据类型的理解(20分)](#org025fa80)
3.  [编程题](#orgccc2539)
    1.  [上台阶问题(20分)](#org16b8ca1)
    2.  [求符合要求的4位数(20分)](#org0a881a3)


<a id="org28bf6d5"></a>

# 简答题


<a id="org303a8d6"></a>

## 给出下列语句的循环次数(10分)

    int i = 0;
    while (i < 10) {
      if (i & 1)
        i++;
      if (i == 5 || i == 8)
        break;
      i++;
     }


<a id="org27b8e06"></a>

# 论述题


<a id="org4c552bd"></a>

## 简述你对于程序设计(编程)的理解(15分)


<a id="org167c295"></a>

## 阅读理解(15分)

[阅读材料](https://baike.baidu.com/item/%E6%B1%89%E8%AF%BA%E5%A1%94/3468295)

请阅读上述材料后阐述自己对于汉诺塔问题理解和想法(可不限于上述材料)


<a id="org025fa80"></a>

## 我们已经学习完了C语言的所有数据类型, 请你阐述对于C语言数据类型的理解(20分)

> 提示: C语言的数据类型和结构是否已经足以描述所有计算机问题?


<a id="orgccc2539"></a>

# 编程题


<a id="org16b8ca1"></a>

## 上台阶问题(20分)

-   问题描述
    小孩上台阶,一次可以上1级台阶,或者2级台阶.假设一共3级台阶,一共有3种方法: 第一次1级,第二次1级,第三次1级;第一次1级,第二次2级; 第一次2级,第二次1级.
    
    请回答假设一共n级台阶,一共有多少种上台阶的方法.

-   答题要求
    实现函数 `int solution(int n);` 输入n为台阶数,返回值为按照题目描述上台阶的方法数.


<a id="org0a881a3"></a>

## 求符合要求的4位数(20分)

-   问题描述
    找出符合要求的所有4位数, 使得该4位数为每个位数的4次方之和. 举例来说:
    
    1634为符合要求的4位数, 因为 1<sup>4</sup> + 6<sup>4</sup> + 3<sup>4</sup> + 4<sup>4</sup> = 1 + 1296 + 81 + 256 = 1634

-   答题要求:
    在 `main` 函数中打印出符合上述要求的所有4位数.

